// pages/me/log/log.js
Page({
  data: {
    logList:[
      {
        time: '2019/02',
        lab:'文献查询、社会调查、方案设计',
        app:'思路分析，数据表设计'
      },
      {
        time: '2019/03',
        lab:'学习实验操作',
        app:'补齐技术盲区'
      },
      {
        time: '2019/03-2019/09',
        lab:'实验研究',
        app:'前后端开发'
      },
      {
        time: '2019/09',
        lab:'数据处理',
        app:'使用模拟数据测试'
      },
      {
        time: '2019/10',
        lab:'得出初步实验数据',
        app:'使用实验数据测试'
      },
      {
        time: '2019/11',
        lab:'调整、纠错、总结',
        app:'调试修改，继续优化'
      },
    ]

  }


})