// pages/me/about/about.js
Page({
  data: {
    commentList: [
      {
        question: '我们的初衷是什么?',
        answer: '&emsp;&emsp;我们想通过实验数据纠正奶茶商家宣传时对消费者的诱导和误导，总结出营养健康地挑选奶茶的方法和搭配配料的建议，同时配合小程序，帮助消费者计算个性化搭配的现制奶茶总热量。'
      },
      {
        question: '我们的实验方法是什么？',
        answer: '&emsp;&emsp;挑选近年来成都市市面常见连锁现制奶茶品牌奶茶（植脂末型、牛奶型等）及配料（奶盖、红豆、燕麦、仙草、珍珠、芋圆、布丁等），经冻干机冻干成固体后，利用压片机进行压片，再利用弹式热量计（Bomb calorimeter）测定其燃烧热，将实验数据进行统计。'
      },
      {
        question: '我们的团队成员有哪些?',
        answer: '指导老师\n🥨李鸣老师（营养与疾病方向)\n 项目成员:\n🍕张倩薇（预防医学专业)\n🍔王铎淏（临床专业）\n🍟刘明佳（营养专业）\n🌭李思蒙（营养专业）\n🍿荆楠清（软件专业)'
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  }
})